let tg = window.Telegram.WebApp; //получаем объект webapp телеграма

tg.expand(); //расширяем на все окно
tg.MainButton.text = 'Save'; //изменяем текст кнопки
tg.MainButton.show();

tg.onEvent('mainButtonClicked', () => {
    tg.sendData(JSON.stringify([...selectedCities]));
});

const russianCities = [
    'Москва',
    'Санкт-Петербург',
    'Сочи',
    'Екатеринбург',
    'Калининград',
    'Казань',
    'Владивосток',
    'Тюмень',
    'Краснодар',
    'Владикавказ',
    'Великий Новгород',
    'Ростов-на-Дону',
    'Минеральные Воды',
    'Уфа',
    'Красноярск',
    'Ярославль',
    'Челябинск',
    'Омск',
    'Астрахань',
    'Волгоград',
    'Нижний Новгород',
    'Анапа',
    'Грозный',
    'Дубна',
    'Сосновый Бор',
    'Геленджик',
    'Ноябрьск',
    'Северск',
    'Долгопрудный',
    'Ханты-Мансийск',
    'Реутов',
    'Майкоп',
    'Губкин',
    'Ступино',
    'Когалым',
    'Железногорск',
    'Сургут',
    'Междуреченск',
    'Нижне-вартовск',
    'Чебоксары',
    'Армавир',
    'Новый Уренгой',
    'Набережные Челны',
    'Славянск-на-Кубани',
    'Абакан',
    'Королев',
    'Мытищи',
    'Обнинск',
    'Бердск',
    'Ставрополь',
    'Раменское',
    'Зеленодольск',
    'Ново-чебоксарск',
    'Саранск',
    'Глазов',
    'Ейск',
    'Северодвинск',
    'Дмитров',
    'Чайковский',
    'Магадан',
    'Горно-Алтайск',
    'Муром',
    'Октябрьский',
    'Новороссийск',
    'Усть-Илимск',
    'Красногорск',
    'Нальчик',
    'Оренбург',
    'Ижевск',
    'Ишим',
    'Владимир',
    'Мурманск',
    'Лениногорск',
    'Барнаул',
    'Верхняя Пышма',
    'Туймазы',
    'Нижнекамск',
    'Стерлитамак',
    'Волгодонск',
    'Железногорск',
    'Кемерово',
    'Гатчина',
    'Новоалтайск',
    'Ивантеевка',
    'Коломна',
    'Белгород',
    'Новосибирск',
    'Ангарск',
    'Киров',
    'Черкесск',
    'Нефтеюганск',
    'Ессентуки',
    'Нефтекамск',
    'Иркутск',
    'Пенза',
    'Туапсе',
    'Калуга',
    'Йошкар-Ола',
    'Новоуральск',
    'Череповец',
    'Пятигорск',
    'Хабаровск',
    'Ишимбай',
    'Химки',
    'Всеволожск',
    'Альметьевск',
    'Вологда',
    'Тобольск',
    'Салават',
    'Псков',
    'Старый Оскол',
    'Чехов',
    'Одинцово',
    'Кстово',
    'Чапаевск',
    'Тамбов',
    'Лобня',
    'Южно-Сахалинск',
    'Томск',
    'Белорецк',
    'Тольятти',
    'Каспийск',
    'Ульяновск',
    'Белогорск',
    'Улан-Удэ',
    'Видное',
    'Благовещенск',
    'Кострома',
    'Димитровград',
    'Кузнецк',
    'Миасс',
    'Елабуга',
    'Севастополь',
    'Смоленск',
    'Воронеж',
    'Пермь',
    'Сарапул',
    'Балаково',
    'Тверь',
    'Сергиев Посад',
    'Липецк',
    'Озерск',
    'Биробиджан',
    'Тула',
    'Иваново',
    'Рыбинск',
    'Орел',
    'Батайск',
    'Кирово-Чепецк',
    'Егорьевск',
    'Арзамас',
    'Сыктывкар',
    'Магнитогорск',
    'Уссурийск',
    'Курск',
    'Кисловодск',
    'Пушкино',
    'Волжский',
    'Бийск',
    'Люберцы',
    'Серпухов',
    'Братск',
    'Бугульма',
    'Петропавловск-Камчатский',
    'Нижний Тагил',
    'Петрозаводск',
    'Камышин',
    'Каменск-Уральский',
    'Ногинск',
    'Самара',
    'Ухта',
    'Клин',
    'Подольск',
    'Клинцы',
    'Азов',
    'Энгельс',
    'Усолье-Сибирское',
    'Кунгур',
    'Таганрог',
    'Березники',
    'Соликамск',
    'Выборг',
    'Балашиха',
    'Ковров',
    'Брянск',
    'Норильск',
    'Елец',
    'Новокузнецк',
    'Георгиевск',
    'Воткинск',
    'Каменск-Шахтинский',
    'Златоуст',
    'Россошь',
    'Новомосковск',
    'Щёлково',
    'Рязань',
    'Невинно-мысск',
    'Сызрань',
    'Перво-уральск',
    'Бузулук',
    'Дзержинск',
    'Серов',
    'Кропоткин',
    'Павловский Посад',
    'Михайловск',
    'Симферополь',
    'Вольск',
    'Кинешма',
    'Орск',
    'Прокопьевск',
    'Электросталь',
    'Орехово-Зуево',
    'Шадринск',
    'Элиста',
    'Минусинск',
    'Новотроицк',
    'Чита',
    'Курган',
    'Ново-куйбышевск',
    'Комсомольск-на-Амуре',
    'Анжеро-Судженск',
    'Саратов',
    'Архангельск',
    'Ачинск',
    'Копейск',
    'Великие Луки',
    'Черногорск',
    'Мичуринск',
    'Воскресенск',
    'Якутск',
    'Асбест',
    'Белово',
    'Киселевск',
    'Махачкала',
    'Троицк',
    'Канск',
    'Балашов',
    'Рубцовск',
    'Ленинск-Кузнецкий',
    'Новошахтинск',
    'Дербент',
    'Новочеркасск',
    'Шахты',
    'Донской',
    'Кызыл',
    'Гуково',
];
const worldCities = [
    'Турция',
    'Анталья',
    'Стамбул',
    'Грузия',
    'Тбилиси',
    'Армения',
    'Ереван',
    'Азербайджан',
    'Баку'

];
const list = document.querySelector('.list-group');
const selectedCities = new Set();

// document.getElementById('321').innerText = tg.initData.slice(9, 33);

const drawCities = (...arguments) => {
    const cities = arguments.flat()
    cities.sort((a, b) => a > b).forEach(city => {
        const placeholder = document.createElement("div");
        placeholder.innerHTML = `
        <label class="list-group-item" xmlns="http://www.w3.org/1999/html">
            <input class="form-check-input me-1"
                type="checkbox"
                value="${city}"
                ${selectedCities.has(city) ? 'checked' : null}
                >${city}</input>
        </label>`;
        list.append(placeholder.firstElementChild);
    });
};

const selectedCounter = document.querySelector('.input-group-text');
const addListItemsEventListeners = () => {
    document.querySelectorAll('.form-check-input').forEach(item => {
        item.addEventListener('change', (val) => {
            const city = val.target.value;
            selectedCities.has(city) ? selectedCities.delete(city) : selectedCities.add(city);
            selectedCounter.innerText = selectedCities.size;
        });
    });
}

document.getElementById('search').addEventListener('input', (element) => {
    list.innerHTML = '';

    const val = element.target.value;
    const filteredCities = [...russianCities, ...worldCities].filter(city => city.toLowerCase().includes(val.toLowerCase()));
    drawCities(filteredCities);
    addListItemsEventListeners();
});

document.getElementById('filter-buttons').addEventListener('change', (element) => {
    list.innerHTML = '';
    switch (element.target.dataset.city) {
        case 'russia':
            drawCities(russianCities);
            break;
        case 'world':
            drawCities(worldCities);
    }
    addListItemsEventListeners();
});

drawCities(russianCities);
addListItemsEventListeners();
